Repository: fincubator/tellerbot
Catalog: locale/*/LC_MESSAGES/bot.po
Languages: id, ru

# transaction_passed {currency}
source: Transaction has passed. I'll notify should you get {currency}.
id: Transaksi telah lulus. Saya akan memberi tahu jika Anda akan mendapatkan {currency}.
ru: Транзакция прошла. Я оповещу когда вы должны будете получить {currency}.

source: Sent
id: Dikirim
ru: Отправлено

# transaction_confirmed
source: Transaction is confirmed.
id: Transaksi telah dikonfirmasi.
ru: Транзакция подтверждена.

# send {amount} {currency} {address}
source: Send {amount} {currency} to address {address}
id: Kirim {amount} {currency} ke alamat {address}
ru: Отправьте {amount} {currency} на адрес {address}

# transaction_not_confirmed
source: Transaction is not confirmed.
id: Transaksi tidak dikonfirmasikan.
ru: Транзакция не подтверждена.

# try_again
source: Please try again.
id: Mohon coba lagi.
ru: Пожалуйста, попробуйте ещё раз.

# transfer_mistakes
source: There are mistakes in your transfer:
id: Ada kesalahan pada transfer Anda:
ru: В вашем переводе есть ошибки:

source: wrong asset
id: Aset salah
ru: неверный актив

source: wrong amount
id: Jumlah salah
ru: неверная сумма

source: wrong memo
id: Memo salah
ru: неверное мемо

# refund_promise
source: Transaction will be refunded after confirmation.
id: Transaksi akan direfund setelah konfirmasi.
ru: Транзакция будет возмещена после подтверждения.

# transaction_refunded
source: Transaction is refunded.
id: Transaksi telah direfund.
ru: Транзакция возмещена.

source: Unknown command.
id: Perintah tidak dikenal.
ru: Неизвестная команда.

source: Unknown button.
id: Tombol tidak dikenal.
ru: Неизвестная кнопка.

# unexpected_error
source: There was an unexpected error when handling your request. We're already notified and will fix it as soon as possible!
id: Terjadi kesalahan tak terduga saat menangani permintaan Anda. Kami sudah diberitahu dan akan memperbaikinya sesegera mungkin!
ru: Возникла неожиданная ошибка во время обработки вашего обращения. Мы уже оповещены и исправим её как можно скорее!

source: Create order
id: Buat pesanan
ru: Создать заказ

source: My orders
id: Pesanan saya
ru: Мои заказы

source: Order book
id: Daftar pesanan
ru: Список заказов

source: Language
id: Bahasa
ru: Язык

source: Support
id: Bantuan
ru: Поддержка

source: Back
id: Kembali
ru: Назад

source: Skip
id: Lewati
ru: Пропустить

source: Cancel
id: Batalkan
ru: Отменить

# no_orders
source: There are no orders.
id: Tidak ada pesanan.
ru: Нет заказов.

source: Invert
id: Membalikan
ru: Инвертировать

# page {number} {total}
source: Page {number} of {total}
id: Halaman {number} dari {total}
ru: Страница {number} из {total}

# buy_amount
source: Amount of buying:
id: Jumlah pembelian:
ru: Сумма покупки:

# sell_amount
source: Amount of selling:
id: Jumlah penjualan:
ru: Сумма продажи:

source: Price:
id: Harga:
ru: Цена:

source: Payment system:
id: Sistem pembayaran:
ru: Система оплаты:

source: Duration:
id: Durasi:
ru: Продолжительность:

source: Comments:
id: Komentar:
ru: Комментарии:

# new_price {of_currency} {per_currency}
source: Send new price in {of_currency}/{per_currency}.
id: Kirim harga baru untuk {of_currency}/{per_currency}.
ru: Отправьте новую цену в {of_currency}/{per_currency}.

source: Archived
id: Diarsipkan
ru: Архивировано

# sells {sell_currency} {buy_currency}
source: sells {sell_currency} for {buy_currency}
id: Jual {sell_currency} untuk {buy_currency}
ru: продаёт {sell_currency} за {buy_currency}

# buys {buy_currency} {sell_currency}
source: buys {buy_currency} for {sell_currency}
id: Beli {buy_currency} untuk {sell_currency}
ru: покупает {buy_currency} за {sell_currency}

source: Finish
id: Selesai
ru: Завершить

source: Similar
id: Serupa
ru: Похожие

source: Match
id: Cocokan
ru: Подобрать

source: Edit
id: Sunting
ru: Редактировать

source: Delete
id: Hapus
ru: Удалить

source: Unarchive
id: Batalkan arsip
ru: Разархивировать

source: Archive
id: Arsip
ru: Архивировать

source: Change duration
id: Perpanjang
ru: Продлить

source: Escrow
id: Rekber
ru: Эскроу

source: Hide
id: Sembunyikan
ru: Скрыть

source: Unset
id: Tidak disetel
ru: Сбросить

# wrong_button
source: You're using the wrong button.
id: Anda menggunakan tombol yang salah.
ru: Вы используете неправильную кнопку.

# back_error
source: Couldn't go back.
id: Tidak bisa kembali.
ru: Не удалось пойти назад.

# skip_error
source: Couldn't skip.
id: Tidak bisa dilewati.
ru: Не удалось пропустить.

# no_creation
source: You are not creating order.
id: Anda tidak membuat pesanan.
ru: Вы не создаёте заказ.

# order_cancelled
source: Order is cancelled.
id: Pesanan dibatalkan.
ru: Заказ отменён.

# exceeded_character_limit {limit} {sent}
source: This value should contain less than {limit} characters (you sent {sent} characters).
id: Nilai harus mengandung kurang dari {limit} karakter (Anda mengirim {sent} karakter).
ru: Это значение должно содержать меньше {limit} символов (вы отправили {sent}).

# non_latin_characters_gateway
source: Gateway may only contain latin characters.
id: Gateway hanya boleh berisi karakter latin.
ru: Шлюз может содержать только латинские символы.

source: Request whitelisting
id: Minta masuk daftar putih
ru: Запросить занесение в белый список

# gateway_not_whitelisted {currency}
source: This gateway of {currency} is not whitelisted.
id: Gateway dari {currency} tidak masuk daftar putih.
ru: Этот шлюз {currency} не занесён в белый список.

# non_latin_characters_currency
source: Currency may only contain latin characters.
id: Mata uang hanya boleh mengandung karakter latin.
ru: Валюта может содержать только латинские символы.

# no_fiat_gateway
source: Gateway can't be specified for fiat currencies.
id: Gateway tidak dapat ditentukan untuk mata uang fiat.
ru: Шлюз не может быть указан для фиатных валют.

# choose_gateway {currency}
source: Choose gateway of {currency}.
id: Pilih Gateway untuk {currency}.
ru: Выберите шлюз {currency}.

# currency_not_whitelisted
source: This currency is not whitelisted.
id: Mata uang ini tidak masuk daftar putih.
ru: Эта валюта не занесена в белый список.

# double_request
source: You've already sent request for this currency.
id: Anda telah melakukan permintaan untuk mata uang ini.
ru: Вы уже отправляли запрос для этой валюты.

source: Request sent.
id: Permintaan dikirim.
ru: Запрос отправлен.

# ask_sell_currency
source: What currency do you want to sell?
id: Mata uang apa yang ingin Anda jual?
ru: Какую валюту вы хотите продать?

# ask_buy_currency
source: What currency do you want to buy?
id: Mata uang apa yang ingin Anda beli?
ru: Какую валюту вы хотите купить?

# ask_buy_price {of_currency} {per_currency}
source: At what price (in {of_currency}/{per_currency}) do you want to buy?
id: Pada harga berapa (dalam {of_currency}/{per_currency}) yang ingin Anda beli?
ru: По какой цене (в {of_currency}/{per_currency}) вы хотите купить?

# same_currency_error
source: Currencies should be different.
id: Mata uang harus berbeda.
ru: Валюты должны отличаться.

# ask_sell_price {of_currency} {per_currency}
source: At what price (in {of_currency}/{per_currency}) do you want to sell?
id: Pada harga berapa (dalam {of_currency}/{per_currency}) yang ingin Anda jual?
ru: По какой цене (в {of_currency}/{per_currency}) вы хотите продать?

# ask_sum_currency
source: Choose currency of order sum.
id: Pilih mata uang untuk jumlah pesanan.
ru: Выберите валюту суммы заказа.

# ask_order_sum {currency}
source: Send order sum in {currency}.
id: Kirim jumlah pesanan dalam {currency}.
ru: Отправьте сумму заказа в {currency}.

# choose_sum_currency_with_buttons
source: Choose currency of sum with buttons.
id: Pilih mata uang dalam penjumlahan dengan tombol.
ru: Выберите валюту суммы кнопками.

# ask_location
source: Send location of a preferred meeting point for cash payment.
id: Kirim lokasi titik point untuk pertemuan menggunakan pembayaran cash.
ru: Отправьте локацию предпочитаемого места встречи для наличной оплаты.

# cashless_payment_system
source: Send cashless payment system.
id: Kirim pembayaran dengan sistem nontunai.
ru: Отправьте систему безналичной оплаты.

# location_not_found
source: Location is not found.
id: Lokasi tidak ditemukan.
ru: Локация не найдена.

# ask_duration {limit}
source: Send duration of order up to {limit} days.
id: Kirim durasi untuk pesanan hingga {limit} hari.
ru: Отправьте продолжительность заказа до {limit} дней.

# choose_location
source: Choose one of these locations:
id: Pilih salah satu dari lokasi berikut:
ru: Выберите одну из этих локаций:

source: Send natural number.
id: Kirim nomor alami.
ru: Отправьте натуральное число.

# exceeded_duration_limit {limit}
source: Send number less than {limit}.
id: Kirim nomor kurang dari {limit}.
ru: Отправьте число меньшее, чем {limit}.

# ask_comments
source: Add any additional comments.
id: Tambahkan komentar apapun.
ru: Добавьте какие-либо дополнительные комментарии.

# order_set
source: Order is set.
id: Pesanan telah ditetapkan.
ru: Заказ установлен.

# send_at_least_8_digits
source: You should send at least 8 digits.
id: Anda harus mengirim setidaknya 8 digit.
ru: Вы должны отправить хотя бы 8 цифр.

# digits_parsing_error
source: Can't get digits from message.
id: Tidak mendapatkan digit dari pesan.
ru: Не удалось получить цифры из сообщения.

# offer_not_active
source: Offer is not active.
id: Penawaran tidak aktif.
ru: Предложение неактивно.

# exceeded_order_sum
source: Send number not exceeding order's sum.
id: Kirim nomor tidak melebihi jumlah pesanan.
ru: Отправьте число, не превышающее сумму заявки.

source: Continue
id: Lanjutkan
ru: Продолжить

# exceeded_insurance {amount} {currency}
source: Escrow asset sum exceeds maximum amount to be insured. If you continue, only {amount} {currency} will be protected and refunded in case of unexpected events during the exchange.
id: Jumlah aset escrow melebihi jumlah maksimum yang akan diasuransikan. Jika Anda melanjutkan, hanya {amount} {currency} yang akan dilindungi dan dikembalikan jika terjadi peristiwa tak terduga selama pertukaran.
ru: Сумма актива для эскроу превышает максимальное количество, которое можно застраховать. Если вы продолжите, только {amount} {currency} будут защищены и возмещены в случае неожиданных событий во время обмена.

# exceeded_insurance_options
source: You can send a smaller number, continue with partial insurance or cancel offer.
id: Anda dapat mengirim nomor yang lebih kecil, lanjutkan dengan asuransi sebagian atau membatalkan penawaran.
ru: Вы можете отправить меньшее число, продолжить с частичным страхованием или отменить предложение.

# ask_fee {fee_percents}
source: Do you agree to pay a fee of {fee_percents}%?
id: Apakah Anda setuju untuk membayar biaya sebesar {fee_percents}%?
ru: Вы согласны заплатить комиссию {fee_percents}%?

# will_pay {amount} {currency}
source: (You'll pay {amount} {currency})
id: (Anda akan membayar {amount} {currency})
ru: (Вы заплатите {amount} {currency})

# will_get {amount} {currency}
source: (You'll get {amount} {currency})
id: (Anda akan mendapatkan {amount}{currency})
ru: (Вы получите {amount} {currency})

source: Yes
id: Ya
ru: Да

source: No
id: Tidak
ru: Нет

# escrow_cancelled
source: Escrow was cancelled.
id: Escrow telah dibatalkan.
ru: Эскроу отменено.

source: Choose bank.
id: Pilih bank.
ru: Выберите банк.

# request_full_card_number {currency} {user}
source: Send your full {currency} card number to {user}.
id: Kirim nomor kartu {currency} lengkap Anda ke {user}.
ru: Отправьте {user} полный номер вашей карты {currency}.

# asked_full_card_number {user}
source: I asked {user} to send you their full card number.
id: Saya meminta {user} untuk mengirim kartu lengkap mereka.
ru: Я попросил {user} отправить вам полный номер карты.

# ask_address {currency}
source: Send your {currency} address.
id: Kirim alamat {currency} Anda.
ru: Отправьте ваш адрес {currency}.

# bank_not_supported
source: This bank is not supported.
id: Bank ini tidak didukung.
ru: Этот банк не поддерживается.

# send_first_and_last_4_digits_of_card_number {currency}
source: Send first and last 4 digits of your {currency} card number.
id: Kirim 4 digit pertama dan terakhir dari nomor kartu {currency} Anda.
ru: Отправьте первые и последние 4 цифры номера вашей карты {currency}.

# wrong_full_card_number_receiver {user}
source: You should send it to {user}, not me!
id: Anda harus mengirim ke {user}, bukan kesaya!
ru: Вы должны отправить это {user}, а не мне!

# exchange_continued {user}
source: I continued the exchange with {user}.
id: Saya melanjutkan untuk bertukar dengan {user}.
ru: Я продолжил обмен с {user}.

# send_name_patronymic_surname
source: Send your name, patronymic and first letter of surname separated by spaces.
id: Kirimkan nama, patronimik, dan huruf pertama nama Anda dengan dipisahkan oleh spasi.
ru: Отправьте ваше имя, отчество и первую букву фамилии, разделённые пробелами.

# wrong_word_count {word_count}
source: You should send {word_count} words separated by spaces.
id: Anda harus mengirim {word_count} kata yang dipisahkan oleh spasi.
ru: Вы должны отправить {word_count} слов, разделённых пробелами.

source: Show order
id: Perlihatkan pesanan
ru: Показать заказ

source: Accept
id: Terima
ru: Принять

source: Decline
id: Tolak
ru: Отклонить

source: You got an escrow offer from {user} to sell {sell_amount} {sell_currency} for {buy_amount} {buy_currency}
id: Anda mendapat penawaran escrow dari {user} untuk menjual {sell_amount} {sell_currency} untuk {buy_amount} {buy_currency}
ru: Вы получили предложение эскроу от {user} на продажу {sell_amount} {sell_currency} за {buy_amount} {buy_currency}

source: using {bank}
id: Gunakan {bank}
ru: используя {bank}

source: Offer sent.
id: Penawaran dikirim.
ru: Предложение отправлено.

# escrow_offer_declined
source: Your escrow offer was declined.
id: Penawaran escrow Anda telah ditolak.
ru: Ваше предложение эскроу отклонено.

# offer_declined
source: Offer was declined.
id: Penawaran telah ditolak.
ru: Предложение отклонено.

source: with memo
id: Dengan memo
ru: с мемо

source: Transfer information sent.
id: Informasi transfer dikirim.
ru: Информация для перевода отправлена.

# transaction_completion_notification_promise
source: I'll notify you when transaction is complete.
id: Saya akan memberitahu ketika transaksi telah komplit.
ru: Я оповещу вас когда транзакция будет совершена.

# cancel_after_transfer
source: You can't cancel offer after transfer to escrow.
id: Anda tidak bisa membatalkan penawaran setelah transfer ke escrow.
ru: Вы не можете отменить предложение после перевода на эскроу.

# cancel_before_verification
source: You can't cancel this offer until transaction will be verified.
id: Anda tidak bisa menbatalkan penawaran ini sampai transaksi diverifikasi.
ru: Вы не можете отменить это предложение пока транзакция не будет подтверждена.

# receiving_confirmation {currency} {user}
source: Did you get {currency} from {user}?
id: Apakah anda mendapatkan {currency} dari {user}?
ru: Вы получили {currency} от {user}?

# complete_escrow_promise
source: When your transfer is confirmed, I'll complete escrow.
id: Ketika transer Anda telah dikonfirmasi, saya akan menyempurnakan escrow.
ru: Когда ваш перевод подтвердится, я завершу эскроу.

# escrow_completing
source: Escrow is being completed, just one moment.
id: Escrow sedang disempurnakan, tunggu sebentar.
ru: Эскроу завершается, один момент.

# escrow_completed
source: Escrow is completed!
id: Escrow telah komplit!
ru: Эскроу завершено!

# escrow_sent {amount} {currency}
source: I sent you {amount} {currency}.
id: saya mengirim Anda {amount} {currency}.
ru: Я отправил вам {amount} {currency}.

# request_validation_promise
source: We'll manually validate your request and decide on the return.
id: Kami akan memvalidasi permintaan Anda secara manual dan memutuskan pengembalian.
ru: Мы вручную проверим ваше обращение и определимся с возвратом.

# order_not_found
source: Order is not found.
id: Pesanan tidak ditemukan.
ru: Заказ не найден.

# no_more_orders
source: There are no more orders.
id: Tidak ada pesanan lagi.
ru: Больше нет заказов.

# no_previous_orders
source: There are no previous orders.
id: Tidak ada pesanan sebelumnya.
ru: Нет предыдущих заказов.

# escrow_unavailable
source: Escrow is temporarily unavailable. Sorry for the inconvenience.
id: Escrow sementara tidak tersedia. Maaf untuk ketidaknyamanannya.
ru: Эскроу временно недоступен. Извините за неудобства.

source: Change to {currency}
id: Ganti ke {currency}
ru: Поменять на {currency}

# send_exchange_sum {currency}
source: Send exchange sum in {currency}.
id: Kirim jumlah penukaran dalam {currency}.
ru: Отправьте сумму обмена в {currency}.

# edit_order_error
source: Couldn't edit order.
id: Tidak dapat mengedit pesanan.
ru: Не удалось отредактировать заказ.

# send_new_buy_amount
source: Send new amount of buying.
id: Kirim jumlah pembelian baru.
ru: Отправьте новую сумму покупки.

# send_new_sell_amount
source: Send new amount of selling.
id: Kirim jumlah penjualan baru.
ru: Отправьте новую сумму продажи.

source: Send new payment system.
id: Kirim sistem pembayaran baru.
ru: Отправьте новую систему оплаты.

# send_new_duration {limit}
source: Send new duration up to {limit} days.
id: Kirim durasi baru hingga {limit} hari.
ru: Отправьте новую продолжительность до {limit} дней.

# repeat_duration_singular {days}
source: Repeat {days} day
id: Ulangi {days} hari
ru: Повторить {days} день

source: Send new comments.
id: Kirim komentar baru.
ru: Отправьте новые комментарии.

# unarchive_order_error
source: Couldn't unarchive order.
id: Tidak dapat membatalkan arsip pesanan.
ru: Не удалось разархивировать заказ.

# archive_order_error
source: Couldn't archive order.
id: Tidak dapat mengarsipkan pesanan.
ru: Не удалось архивировать заказ.

# totally_sure
source: Yes, I'm totally sure
id: Ya, saya sangat yakin
ru: Да, я полностью уверен(а)

# delete_order_confirmation
source: Are you sure you want to delete the order?
id: Apakah Anda yakin ingin menghapus pesanan?
ru: Вы уверены, что хотите удалить этот заказ?

# delete_order_error
source: Couldn't delete order.
id: Tidak dapat menghapus pesanan.
ru: Не удалось удалить заказ.

# order_deleted
source: Order is deleted.
id: Pesanan dihapus.
ru: Заказ удалён.

# hide_order_error
source: Couldn't hide order.
id: Tidak bisa menyembunyikan pesanan.
ru: Не удалось скрыть заказ.

# choose_language
source: Please, choose your language.
id: Silakan pilih bahasa Anda.
ru: Пожалуйста, выберите свой язык.

# help_message
source: Hello, I'm TellerBot. I can help you meet with people that you can swap money with. Choose one of the options on your keyboard.
id: Halo, saya TellerBot. Saya dapat membantu Anda bertemu dengan orang-orang yang dapat bertukar uang dengan Anda. Pilih salah satu opsi di keyboard Anda.
ru: Здравствуйте, я TellerBot. Я могу помочь вам встретить людей, с которыми вы можете обмениваться деньгами. Выберите один из вариантов на вашей клавиатуре.

# exceeded_order_creation_time_limit {orders} {hours}
source: You can't create more than {orders} orders in {hours} hours.
id: Anda tidak dapat membuat lebih dari {orders} pesanan dalam waktu {hours} jam.
ru: Вы не можете создать больше чем {orders} заказов за {hours} часа.

source: Choose your language.
id: Pilih bahasamu.
ru: Выберите свой язык.

# request_question
source: What's your question?
id: Apa pertanyaanmu?
ru: Какой у вас вопрос?

# user_not_found
source: User is not found.
id: Pengguna tidak ditemukan.
ru: Пользователь не найден.

# no_user_argument
source: Send username as an argument.
id: Kirim nama pengguna sebagai argumen.
ru: Отправьте username в качестве аргумента.

source: Your subscriptions:
id: Langganan Anda:
ru: Ваши подписки:

# no_subscriptions
source: You don't have subscriptions.
id: Anda tidak memiliki langganan.
ru: У вас нет подписок.

# no_currency_argument
source: Send currency or currency pair as an argument.
id: Kirim mata uang atau pair mata uang sebagai argumen.
ru: Отправьте валюту или пару валют в качестве аргумента.

# subscription_added
source: Subscription is added.
id: Berlangganan ditambahkan.
ru: Подписка добавлена.

# subscription_exists
source: Subscription already exists.
id: Berlangganan sudah ada.
ru: Подписка уже существует.

# subscription_deleted
source: Subscription is deleted.
id: Berlangganan dihapus.
ru: Подписка удалена.

# subscription_delete_error
source: Couldn't delete subscription.
id: Tidak dapat menghapus langganan.
ru: Не удалось удалить подписку.

# request_cancelled
source: Your request is cancelled.
id: Permintaan Anda dibatalkan.
ru: Ваш запрос отменён.

# support_response_promise
source: Your message was forwarded. We'll respond to you within 24 hours.
id: Pesan Anda telah diteruskan. Kami akan merespons Anda dalam waktu 24 jam.
ru: Ваше сообщение переслано. Мы ответим вам в течение 24 часов.

# reply_sent
source: Reply is sent.
id: Balasan sudah terkirim.
ru: Ответ отправлен.

# escrow_enabled
source: Escrow was enabled.
id: Escrow diaktifkan.
ru: Эскроу включен.

# escrow_disabled
source: Escrow was disabled.
id: Escrow dinonaktifkan.
ru: Эскроу выключен.

source: Send decimal number.
id: Kirim angka desimal.
ru: Отправьте десятичное число.

source: Send positive number.
id: Kirim angka positif.
ru: Отправьте положительное число.

# exceeded_money_limit {limit}
source: Send number less than {limit}
id: Kirim nomor kurang dari {limit}
ru: Отправьте число меньшее, чем {limit}

# shortage_money_limit {limit}
source: Send number greater than {limit}
id: Kirim nomor lebih besar dari {limit}
ru: Отправьте число большее, чем {limit}

# order_expired
source: Your order has expired.
id: Pesanan Anda telah kedaluwarsa.
ru: Срок действия вашего заказа истёк.

source: Without gateway
id: Tanpa gateway
ru: Без шлюза
